## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 16 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                               NAME                                               |
|--------|--------------------------------------------------------------------------------------------------|
| add    | `aws_secretsmanager_secret.gha_vpn_cert`                                                         |
|        | `aws_secretsmanager_secret.gha_vpn_key`                                                          |
|        | `aws_secretsmanager_secret_version.gha_vpn_cert`                                                 |
|        | `aws_secretsmanager_secret_version.gha_vpn_key`                                                  |
|        | `module.gha_vpn.aws_acm_certificate.client_vpn[0]`                                               |
|        | `module.gha_vpn.aws_cloudwatch_log_group.this`                                                   |
|        | `module.gha_vpn.aws_ec2_client_vpn_authorization_rule.this_internal_dns`                         |
|        | `module.gha_vpn.aws_ec2_client_vpn_authorization_rule.this_subnets_certificate[&quot;10.0.0.0/24&quot;]`   |
|        | `module.gha_vpn.aws_ec2_client_vpn_authorization_rule.this_subnets_certificate[&quot;10.0.1.0/24&quot;]`   |
|        | `module.gha_vpn.aws_ec2_client_vpn_authorization_rule.this_subnets_certificate[&quot;10.0.2.0/24&quot;]`   |
|        | `module.gha_vpn.aws_ec2_client_vpn_endpoint.this`                                                |
|        | `module.gha_vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-001e585d12cce4d1e&quot;]` |
|        | `module.gha_vpn.aws_security_group.this`                                                         |
|        | `module.gha_vpn.aws_security_group_rule.egress_all`                                              |
|        | `module.gha_vpn.tls_private_key.client_vpn[0]`                                                   |
|        | `module.gha_vpn.tls_self_signed_cert.client_vpn[0]`                                              |
| delete | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-08de34a9e1a7458dc&quot;]`     |
|        | `module.vpn.aws_ec2_client_vpn_network_association.this_subnets[&quot;subnet-0af8b8402f1d605ff&quot;]`     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_secretsmanager_secret.gha_vpn_cert will be created
  + resource "aws_secretsmanager_secret" "gha_vpn_cert" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "GHA_VPN_CERT"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret.gha_vpn_key will be created
  + resource "aws_secretsmanager_secret" "gha_vpn_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "GHA_VPN_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret_version.gha_vpn_cert will be created
  + resource "aws_secretsmanager_secret_version" "gha_vpn_cert" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.gha_vpn_key will be created
  + resource "aws_secretsmanager_secret_version" "gha_vpn_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.gha_vpn.aws_acm_certificate.client_vpn[0] will be created
  + resource "aws_acm_certificate" "client_vpn" {
      + arn                       = (known after apply)
      + certificate_body          = (known after apply)
      + domain_name               = (known after apply)
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + private_key               = (sensitive value)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = (known after apply)
    }

  # module.gha_vpn.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/client-vpn-endpoint/gha-vpn"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
    }

  # module.gha_vpn.aws_ec2_client_vpn_authorization_rule.this_internal_dns will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_internal_dns" {
      + authorize_all_groups   = true
      + client_vpn_endpoint_id = (known after apply)
      + description            = "Authorization for gha-vpn to DNS"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.0.2/32"
    }

  # module.gha_vpn.aws_ec2_client_vpn_authorization_rule.this_subnets_certificate["10.0.0.0/24"] will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_subnets_certificate" {
      + authorize_all_groups   = true
      + client_vpn_endpoint_id = (known after apply)
      + description            = "Rule name: 10.0.0.0/24"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.0.0/24"
    }

  # module.gha_vpn.aws_ec2_client_vpn_authorization_rule.this_subnets_certificate["10.0.1.0/24"] will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_subnets_certificate" {
      + authorize_all_groups   = true
      + client_vpn_endpoint_id = (known after apply)
      + description            = "Rule name: 10.0.1.0/24"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.1.0/24"
    }

  # module.gha_vpn.aws_ec2_client_vpn_authorization_rule.this_subnets_certificate["10.0.2.0/24"] will be created
  + resource "aws_ec2_client_vpn_authorization_rule" "this_subnets_certificate" {
      + authorize_all_groups   = true
      + client_vpn_endpoint_id = (known after apply)
      + description            = "Rule name: 10.0.2.0/24"
      + id                     = (known after apply)
      + target_network_cidr    = "10.0.2.0/24"
    }

  # module.gha_vpn.aws_ec2_client_vpn_endpoint.this will be created
  + resource "aws_ec2_client_vpn_endpoint" "this" {
      + arn                     = (known after apply)
      + client_cidr_block       = "172.16.0.0/22"
      + description             = "gha-vpn"
      + dns_name                = (known after apply)
      + dns_servers             = [
          + "10.0.0.2",
          + "8.8.8.8",
        ]
      + id                      = (known after apply)
      + security_group_ids      = (known after apply)
      + self_service_portal     = "disabled"
      + self_service_portal_url = (known after apply)
      + server_certificate_arn  = "arn:aws:acm:ca-central-1:239043911459:certificate/4a2d1268-b54e-4643-9fac-cc6a241d963b"
      + session_timeout_hours   = 8
      + split_tunnel            = true
      + tags                    = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + tags_all                = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + transport_protocol      = "udp"
      + vpc_id                  = "vpc-097508d1f5e243195"
      + vpn_port                = 443

      + authentication_options {
          + root_certificate_chain_arn = (known after apply)
          + type                       = "certificate-authentication"
        }

      + client_login_banner_options {
          + banner_text = "Welcome to the Notify STAGING Environment. This is a private network.  Only authorized users may connect and should take care not to cause service disruptions."
          + enabled     = true
        }

      + connection_log_options {
          + cloudwatch_log_group  = "/aws/client-vpn-endpoint/gha-vpn"
          + cloudwatch_log_stream = (known after apply)
          + enabled               = true
        }
    }

  # module.gha_vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-001e585d12cce4d1e"] will be created
  + resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      + association_id         = (known after apply)
      + client_vpn_endpoint_id = (known after apply)
      + id                     = (known after apply)
      + subnet_id              = "subnet-001e585d12cce4d1e"
      + vpc_id                 = (known after apply)
    }

  # module.gha_vpn.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Egress All. Used to allow access to other security groups."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "client-vpn-endpoint-gha-vpn"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Source"     = "cds-snc/terraform-modules/client_vpn"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-097508d1f5e243195"
    }

  # module.gha_vpn.aws_security_group_rule.egress_all will be created
  + resource "aws_security_group_rule" "egress_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.gha_vpn.tls_private_key.client_vpn[0] will be created
  + resource "tls_private_key" "client_vpn" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.gha_vpn.tls_self_signed_cert.client_vpn[0] will be created
  + resource "tls_self_signed_cert" "client_vpn" {
      + allowed_uses          = [
          + "key_encipherment",
          + "digital_signature",
          + "server_auth",
          + "ipsec_end_system",
          + "ipsec_tunnel",
          + "any_extended",
          + "cert_signing",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = false
      + key_algorithm         = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = false
      + set_authority_key_id  = false
      + set_subject_key_id    = false
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)

      + subject {
          + common_name  = "cds-snc.ca"
          + organization = "Canadian Digital Service"
        }
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-08de34a9e1a7458dc"] will be destroyed
  # (because key ["subnet-08de34a9e1a7458dc"] is not in for_each map)
  - resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      - association_id         = "cvpn-assoc-0017d2ca75427e2fa" -> null
      - client_vpn_endpoint_id = "cvpn-endpoint-09a79e8845a82dbf3" -> null
      - id                     = "cvpn-assoc-0017d2ca75427e2fa" -> null
      - subnet_id              = "subnet-08de34a9e1a7458dc" -> null
      - vpc_id                 = "vpc-097508d1f5e243195" -> null
    }

  # module.vpn.aws_ec2_client_vpn_network_association.this_subnets["subnet-0af8b8402f1d605ff"] will be destroyed
  # (because key ["subnet-0af8b8402f1d605ff"] is not in for_each map)
  - resource "aws_ec2_client_vpn_network_association" "this_subnets" {
      - association_id         = "cvpn-assoc-03b273db07dac4779" -> null
      - client_vpn_endpoint_id = "cvpn-endpoint-09a79e8845a82dbf3" -> null
      - id                     = "cvpn-assoc-03b273db07dac4779" -> null
      - subnet_id              = "subnet-0af8b8402f1d605ff" -> null
      - vpc_id                 = "vpc-097508d1f5e243195" -> null
    }

  # module.vpn.aws_iam_saml_provider.client_vpn has moved to module.vpn.aws_iam_saml_provider.client_vpn[0]
    resource "aws_iam_saml_provider" "client_vpn" {
        id                     = "arn:aws:iam::239043911459:saml-provider/client-vpn"
        name                   = "client-vpn"
        tags                   = {
            "CostCentre" = "notification-canada-ca-staging"
            "Source"     = "cds-snc/terraform-modules/client_vpn"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 16 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
